<template lang="pug">
  article.presentational-product
    header.presentational-product__header
      picture.presentational-product__photo
        source(media="(min-width: 1280px)" srcset="../assets/tablet-photo-desktop.png")
        source(media="(min-width: 800px)" srcset="../assets/tablet-photo-tablet.png")
        img(src="../assets/tablet-photo-mobile.png" alt="Фотография планшета")
      .presentational-product__header-wrapper
        svg(class="presentational-product__header-title" viewBox="0 0 212 82")
          <defs>
            <path id="2gjab" d="M71.634 1000.145c0 2.405.754 3.404 3.309 3.404 2.548 0 3.283-1 3.283-3.404V992h3.086v8.219c0 1.742-.203 2.935-.857 3.654-1.208 1.327-2.964 1.876-5.512 1.876-2.555 0-4.325-.549-5.531-1.876-.677-.737-.842-1.932-.842-3.654V992h3.064z"/><path id="2gjac" d="M91.386 992l6.254 13.601h-3.434l-1.347-3.24h-6.375l-1.306 3.24H81.91L88.115 992zm-3.9 7.94h4.372l-2.228-5.228z"/>
            <path id="2gjad" d="M99.043 992l3.39 10.455L105.294 992h3.632l3.289 10.455 3.16-10.455h3.17l-4.537 13.601h-3.773l-3.126-10.154-2.735 10.154h-3.761L95.73 992z"/>
            <path id="2gjae" d="M122.69 997.53h8.539v2.364h-8.562c.024 2.447 1.064 3.338 3.493 3.338h5.069v2.369h-5.214c-1.771 0-3.142-.134-4.576-1.194-1.506-1.118-2.239-2.901-2.239-5.361 0-4.804 2.184-7.046 6.9-7.046h5.129v2.369h-5.07c-2.224 0-3.342 1.025-3.468 3.161"/>
            <path id="2gjaa" d="M53 1073.191h211.91V992H53z"/>
            <path id="2gjag" d="M133.95 1005.601h3.224V992h-3.224z"/>
            <path id="2gjah" d="M56.087 997.51h6.864V992h3.085v13.601H62.95v-5.683h-6.864v5.683H53V992h3.087z"/>
            <path id="2gjai" d="M74.862 1041.756v-20.899l-7.47 20.9h-3.375l-7.504-20.9v20.9H53.17v-23.667h5.594l7.027 19.443 6.957-19.443h5.626v23.666z"/>
            <path id="2gjaj" d="M84.543 1033.81c0 .827.12 1.595.36 2.303a5.325 5.325 0 0 0 1.04 1.847c.453.52 1.009.935 1.67 1.24.658.31 1.398.463 2.216.463.772 0 1.619-.108 2.54-.32.92-.212 1.723-.52 2.406-.923l.205 2.767a13.49 13.49 0 0 1-2.797.729c-1 .153-1.968.23-2.9.23-1.41 0-2.631-.225-3.664-.673a6.796 6.796 0 0 1-2.577-1.918c-.682-.826-1.188-1.808-1.516-2.944-.33-1.135-.496-2.401-.496-3.795 0-1.208.184-2.366.545-3.478.364-1.113.876-2.089 1.536-2.928a7.355 7.355 0 0 1 2.421-2.004c.955-.498 2.023-.746 3.205-.746 1.274 0 2.36.237 3.257.71a6.2 6.2 0 0 1 2.218 1.95c.58.83 1 1.793 1.262 2.892.261 1.101.391 2.277.391 3.531v1.066zm8.048-2.202c0-.637-.063-1.282-.187-1.934a5.902 5.902 0 0 0-.631-1.774 3.714 3.714 0 0 0-1.178-1.294c-.488-.331-1.096-.497-1.823-.497-.729 0-1.358.177-1.892.533a4.48 4.48 0 0 0-1.33 1.366 6.342 6.342 0 0 0-.784 1.79 6.945 6.945 0 0 0-.256 1.81z"/><path id="2gjak" d="M111.048 1041.752l-.206-2.944c-.523 1.136-1.248 1.975-2.181 2.519s-1.99.817-3.172.817c-1.296 0-2.387-.265-3.274-.798a6.658 6.658 0 0 1-2.182-2.112c-.57-.875-.978-1.869-1.23-2.98a15.661 15.661 0 0 1-.373-3.441c0-1.183.124-2.328.374-3.425.251-1.1.66-2.077 1.23-2.929a6.447 6.447 0 0 1 2.18-2.04c.888-.508 1.98-.762 3.275-.762 1.07 0 2.087.284 3.053.852.967.567 1.666 1.383 2.1 2.449v-10.788h3.407v20.26c0 .994.019 1.923.052 2.787.034.86.074 1.708.12 2.535zm-.306-8.903c0-.71-.074-1.442-.223-2.2a7.5 7.5 0 0 0-.73-2.092 4.523 4.523 0 0 0-1.348-1.56c-.559-.403-1.247-.605-2.065-.605-.887 0-1.603.196-2.148.585-.547.391-.979.9-1.297 1.526a6.782 6.782 0 0 0-.649 2.093c-.113.77-.17 1.52-.17 2.253 0 .733.063 1.483.189 2.253.124.767.345 1.47.664 2.11a4.36 4.36 0 0 0 1.313 1.578c.558.413 1.267.62 2.131.62.82 0 1.506-.213 2.065-.637a4.912 4.912 0 0 0 1.347-1.597c.343-.638.58-1.341.715-2.11.138-.768.206-1.508.206-2.217z"/><path id="2gjal" d="M116.57 1020.362h3.41v-3.442h-3.41zm0 21.396h3.41v-17.74h-3.41z"/>
            <path id="2gjam" d="M133.828 1041.755l-.103-2.802a5.75 5.75 0 0 1-2.25 2.34 6.084 6.084 0 0 1-3.105.852 7.71 7.71 0 0 1-2.182-.301 5.097 5.097 0 0 1-1.79-.921 4.495 4.495 0 0 1-1.226-1.582c-.308-.637-.462-1.394-.462-2.27 0-1.158.243-2.134.733-2.926a5.531 5.531 0 0 1 1.996-1.916c.84-.484 1.823-.834 2.951-1.047a19.116 19.116 0 0 1 3.563-.32h.818c.32 0 .602.01.853.034v-.742c0-1.301-.312-2.295-.939-2.982-.623-.685-1.607-1.028-2.95-1.028-.864 0-1.72.112-2.575.337a8.442 8.442 0 0 0-2.437 1.082l-.206-2.733c.795-.33 1.7-.609 2.711-.834 1.013-.224 1.949-.336 2.814-.336 2.205 0 3.912.525 5.118 1.578 1.203 1.054 1.807 2.774 1.807 5.163v7.415a32.819 32.819 0 0 0 .204 3.94zm-.204-8.693h-.548c-.678 0-1.432.03-2.247.09a8.3 8.3 0 0 0-2.287.477c-.706.262-1.292.645-1.755 1.153-.468.511-.702 1.202-.702 2.075 0 .97.32 1.681.956 2.13.636.45 1.377.676 2.219.676.817 0 1.504-.155 2.06-.462a3.752 3.752 0 0 0 1.35-1.241 5.4 5.4 0 0 0 .731-1.793c.148-.674.223-1.39.223-2.147z"/><path id="2gjan" d="M154.87 1025.114c0 1.231-.204 2.296-.612 3.193-.409.899-.958 1.645-1.65 2.236a6.93 6.93 0 0 1-2.414 1.33 9.402 9.402 0 0 1-2.909.444h-3.84v9.44h-3.685v-23.667h7.64c1.046 0 2.03.147 2.95.443.92.295 1.71.74 2.37 1.331.66.591 1.183 1.325 1.57 2.198.385.877.58 1.893.58 3.052m-3.786.053c0-1.473-.437-2.553-1.308-3.242-.87-.689-1.963-1.033-3.274-1.033h-3.058v8.623h1.732a19.2 19.2 0 0 0 2.19-.125c.712-.083 1.345-.273 1.901-.57a3.319 3.319 0 0 0 1.327-1.319c.327-.582.49-1.36.49-2.334"/><path id="2gjao" d="M165.787 1041.755l-.104-2.802a5.743 5.743 0 0 1-2.25 2.34 6.083 6.083 0 0 1-3.105.852c-.773 0-1.5-.101-2.181-.301a5.076 5.076 0 0 1-1.789-.921 4.502 4.502 0 0 1-1.23-1.582c-.306-.637-.458-1.394-.458-2.27 0-1.158.243-2.134.732-2.926a5.539 5.539 0 0 1 1.994-1.916c.842-.484 1.825-.834 2.95-1.047a19.162 19.162 0 0 1 3.567-.32h.815c.32 0 .603.01.853.034v-.742c0-1.301-.313-2.295-.938-2.982-.623-.685-1.606-1.028-2.95-1.028-.864 0-1.721.112-2.573.337a8.46 8.46 0 0 0-2.44 1.082l-.204-2.733c.795-.33 1.7-.609 2.712-.834 1.01-.224 1.949-.336 2.812-.336 2.207 0 3.912.525 5.117 1.578 1.204 1.054 1.807 2.774 1.807 5.163v7.415c0 .759.02 1.45.05 2.077.035.626.087 1.249.154 1.862zm-.204-8.693h-.546c-.68 0-1.434.03-2.25.09a8.31 8.31 0 0 0-2.287.477c-.707.262-1.292.645-1.758 1.153-.465.511-.701 1.202-.701 2.075 0 .97.319 1.681.958 2.13.637.45 1.375.676 2.218.676.818 0 1.506-.155 2.064-.462a3.744 3.744 0 0 0 1.349-1.241 5.37 5.37 0 0 0 .733-1.793c.148-.674.22-1.39.22-2.147z"/><path id="2gjap" d="M184.468 1041.752l-.206-2.944c-.521 1.136-1.248 1.975-2.181 2.519-.931.544-1.99.817-3.172.817-1.296 0-2.387-.265-3.274-.798a6.653 6.653 0 0 1-2.18-2.112c-.572-.875-.978-1.869-1.231-2.98a15.757 15.757 0 0 1-.374-3.441c0-1.183.126-2.328.374-3.425.253-1.1.66-2.077 1.23-2.929a6.442 6.442 0 0 1 2.18-2.04c.888-.508 1.98-.762 3.275-.762 1.07 0 2.087.284 3.054.852.966.567 1.663 1.383 2.097 2.449v-10.788h3.41v20.26c0 .994.016 1.923.05 2.787.035.86.075 1.708.122 2.535zm-.308-8.903c0-.71-.076-1.442-.222-2.2a7.408 7.408 0 0 0-.733-2.092 4.49 4.49 0 0 0-1.346-1.56c-.556-.403-1.244-.605-2.063-.605-.887 0-1.602.196-2.145.585-.548.391-.98.9-1.298 1.526a6.87 6.87 0 0 0-.649 2.093c-.113.77-.17 1.52-.17 2.253 0 .733.064 1.483.19 2.253.125.767.345 1.47.663 2.11a4.376 4.376 0 0 0 1.312 1.578c.559.413 1.267.62 2.13.62.82 0 1.505-.213 2.064-.637a4.888 4.888 0 0 0 1.345-1.597c.342-.638.58-1.341.716-2.11.138-.768.206-1.508.206-2.217z"/><path id="2gjaq" d="M223.08 1041.82v-21.19l-8.275 21.19h-2.7l-8.272-21.19v21.19h-2.593v-23.48h4.275l8.029 20.382 7.958-20.382h4.277v23.48z"/><path id="2gjar" d="M245.303 1034.393c0 1.268-.232 2.39-.7 3.362a7.007 7.007 0 0 1-1.91 2.444 8.479 8.479 0 0 1-2.804 1.498c-1.065.34-2.193.51-3.385.51a22.09 22.09 0 0 1-2.734-.175c-.932-.119-1.809-.34-2.63-.669l.21-2.57a9.035 9.035 0 0 0 2.42.845c.84.164 1.695.246 2.559.246.82 0 1.597-.11 2.333-.334a5.77 5.77 0 0 0 1.944-1.003 4.963 4.963 0 0 0 1.35-1.673c.338-.669.508-1.437.508-2.306 0-.89-.15-1.648-.455-2.27a4.2 4.2 0 0 0-1.246-1.532 5.242 5.242 0 0 0-1.839-.878 8.738 8.738 0 0 0-2.28-.282c-.747 0-1.514.07-2.296.21-.783.141-1.664.376-2.646.704l.245-12.18h12.235v2.253h-9.675l-.209 7.324a7.159 7.159 0 0 1 1.647-.37c.56-.06 1.122-.09 1.682-.09 1.052 0 2.046.147 2.98.44a7.094 7.094 0 0 1 2.454 1.32 6.146 6.146 0 0 1 1.647 2.185c.397.867.595 1.864.595 2.991"/><path id="2gjas" d="M105.28 1064.188h1.085v-1.128h-1.085z"/><path id="2gjat" d="M170.14 1057.68h1.768v3.23h.024c.339-.587.997-1.011 1.68-1.011 1.566 0 2.624.651 2.624 2.345v4.53h-1.765v-4.016c0-.603-.078-1.312-1.277-1.312-1.074 0-1.286.586-1.286 1.135v4.193h-1.768v-9.094"/><path id="2gjau" d="M181.619 1066.774c-.127-.164-.201-.437-.189-.675-.617.572-1.16.96-2.197.96-1.386 0-2.07-.774-2.02-2.084.04-.948.419-1.87 1.983-2.13a7.136 7.136 0 0 0 1.78-.313c.315-.114.465-.438.442-.762 0-.422-.355-.612-1.16-.612-1.012 0-1.138.612-1.163 1.098h-1.667c.028-2.157 1.893-2.356 2.83-2.356.68 0 1.273.112 1.614.25.681.274 1.225.822 1.225 1.895v3.691c-.011.301.161.601.39.798v.24h-1.868zm-.191-3.182c-.508.3-1.19.274-1.65.362-.543.1-.923.549-.77 1.096.099.4.416.686 1.176.565 1.055-.164 1.244-.89 1.244-1.635z"/><path id="2gjav" d="M184.7 1060.011h1.768v1.31h.025c.112-.4.203-.633.82-1.06.302-.225.707-.449 1.261-.362v1.784c-.757-.089-1.894-.188-2.106 1.285v3.805H184.7v-6.762"/><path id="2gjaw" d="M189.8 1066.773v-6.762h1.768v1.01h.024c.556-.799 1.06-1.26 2.096-1.122.869.112 1.112.411 1.615.985.427-.597.96-1.148 2.396-.985 1.365.199 1.741 1.096 1.741 2.182v4.692h-1.765v-4.654c-.026-.5-.464-.686-.884-.711-.945-.062-1.286.762-1.286 1.222v4.143h-1.768v-4.654c-.1-.475-.416-.7-.97-.711-.62-.013-1.199.388-1.199 1.222v4.143H189.8"/><path id="2gjax" d="M204.916 1066.774c-.126-.164-.201-.437-.19-.675-.619.572-1.16.96-2.195.96-1.387 0-2.069-.774-2.018-2.084.037-.948.416-1.87 1.98-2.13a7.122 7.122 0 0 0 1.78-.313c.316-.114.469-.438.442-.762 0-.422-.355-.612-1.16-.612-1.012 0-1.138.612-1.163 1.098h-1.667c.026-2.157 1.897-2.356 2.83-2.356.68 0 1.273.112 1.614.25.683.274 1.223.822 1.223 1.895v3.691c-.01.301.163.601.39.798v.24h-1.866zm-.201-3.182c-.506.3-1.187.274-1.64.362-.544.1-.923.549-.77 1.096.1.4.414.686 1.174.565 1.046-.164 1.236-.89 1.236-1.635z"/><path id="2gjay" d="M208 1060.012h1.768v1.022h.024c.342-.71.997-1.134 1.68-1.134 1.566 0 2.624.648 2.624 2.345v4.529h-1.766v-4.017c0-.6-.077-1.312-1.276-1.312-1.072 0-1.286.589-1.286 1.137v4.192H208v-6.762"/><path id="2gjaz" d="M224.457 1057.68v4.964h.025l2.206-2.632h2.021l-2.308 2.582 2.459 4.18h-2.068l-1.602-2.895-.733.784v2.111h-1.767v-9.094z"/><path id="2gjaA" d="M233.777 1066.774c-.128-.164-.2-.437-.188-.675-.62.572-1.16.96-2.197.96-1.39 0-2.07-.774-2.02-2.084.04-.948.418-1.87 1.982-2.13a7.19 7.19 0 0 0 1.781-.313c.313-.114.465-.438.441-.762 0-.422-.354-.612-1.16-.612-1.011 0-1.137.612-1.164 1.098h-1.666c.027-2.157 1.894-2.356 2.83-2.356.677 0 1.27.112 1.613.25.681.274 1.223.822 1.223 1.895v3.691c-.013.301.165.601.393.798v.24h-1.868zm-.204-3.182c-.504.3-1.184.274-1.638.362-.54.1-.918.549-.768 1.096.1.4.415.686 1.17.565 1.047-.164 1.236-.89 1.236-1.635z"/><path id="2gjaB" d="M236.86 1060.011h1.765v1.31h.028c.113-.4.201-.633.822-1.06.301-.225.702-.449 1.26-.362v1.784c-.76-.089-1.895-.188-2.11 1.285v3.805h-1.765v-6.762"/><path id="2gjaC" d="M247.866 1066.809h-1.765v-.71h-.025a2.176 2.176 0 0 1-1.73.96c-1.233.05-1.942-.438-2.473-1.56-.276-.61-.48-1.221-.516-1.882-.04-.66.088-1.373.441-2.182.58-1.31 1.704-1.497 2.346-1.533 1.15-.052 1.682.462 1.932 1.033h.025v-3.255h1.765v9.129m-4.429-4.638c-.126.263-.304.76-.304 1.322 0 .56.178 1.058.304 1.323.302.561.77.76 1.188.76.404 0 .871-.199 1.177-.76.125-.265.302-.762.302-1.323 0-.562-.177-1.059-.302-1.322-.306-.561-.773-.762-1.177-.762-.417 0-.886.2-1.188.762"/><path id="2gjaD" d="M250.037 1066.234c-.679-.61-1.007-1.657-1.007-2.758 0-1.096.328-2.143 1.007-2.754.606-.55 1.479-.822 2.361-.822.883 0 1.753.273 2.36.822.68.611 1.01 1.659 1.01 2.754 0 1.101-.33 2.148-1.01 2.758-.607.548-1.477.824-2.36.824-.882 0-1.755-.276-2.361-.824m1.097-4.08c-.14.263-.33.76-.33 1.322 0 .564.19 1.063.33 1.325.327.563.82.762 1.264.762.44 0 .935-.199 1.262-.762.14-.262.33-.761.33-1.325 0-.561-.19-1.059-.33-1.322-.327-.56-.821-.761-1.262-.761-.443 0-.937.2-1.264.76"/><path id="2gjaE" d="M256.93 1060.012h1.767v1.022h.026c.338-.71.994-1.134 1.68-1.134 1.563 0 2.622.648 2.622 2.345v4.529h-1.766v-4.017c0-.6-.076-1.312-1.276-1.312-1.073 0-1.286.589-1.286 1.137v4.192h-1.767v-6.762"/><path id="2gjaF" d="M215.51 1066.782l5.42-9.132h.337l-5.435 9.132z"/><path id="2gjaG" d="M232.722 1072.6v-1.963h-2.615v1.964h-.857v-4.441h.857v1.832h2.615v-1.832h.858v4.44z"/><path id="2gjaH" d="M238.836 1072.602l-.516-1.066h-2.67l-.52 1.066h-.92l2.297-4.442h1.018l2.285 4.442zm-1.85-3.802l-1.03 2.128h2.055z"/><path id="2gjaI" d="M243.689 1072.602c-.055-.238-.11-.572-.16-.763l-.134-.547c-.129-.51-.313-.571-.97-.571h-1.138v1.881h-.857v-4.442h2.334c1.157 0 1.647.468 1.647 1.194 0 .794-.858 1.022-1.06 1.053.534.043.827.19.945.878l.159.764c.042.24.104.466.144.553zm-1.126-3.82h-1.276v1.318h1.276c.68 0 .967-.185.967-.666 0-.46-.287-.651-.967-.651z"/><path id="2gjaJ" d="M250.846 1072.6v-3.88l-1.808 3.88h-.937l-1.806-3.88v3.88h-.765v-4.44h1.358l1.723 3.726 1.713-3.726h1.356v4.44z"/><path id="2gjaK" d="M256.925 1072.602l-.515-1.066h-2.67l-.521 1.066h-.919l2.297-4.442h1.018l2.283 4.442zm-1.849-3.802l-1.03 2.128h2.055z"/><path id="2gjaL" d="M261.793 1072.6l-2.492-3.678v3.679h-.771v-4.441h1.175l2.493 3.677v-3.677h.773v4.44z"/><path id="2gjaM" d="M224.164 1072.598c-.398 0-.625-.144-.76-.327 0 .057-.012.212-.015.26h-.429c.002-.094.011-.29.011-.365v-2.126h.448v1.028a.92.92 0 0 1 .75-.334c.525 0 .964.323.964.925 0 .571-.442.939-.969.939m-.123-1.578c-.373 0-.62.24-.62.647 0 .403.23.635.62.635.381 0 .621-.253.621-.643 0-.399-.227-.639-.62-.639"/><path id="2gjaN" d="M226.39 1073.194h-.492l.364-.658-.942-1.736h.517l.673 1.356.636-1.356h.473z"/><path id="2gjaO" d="M264.1 1059.36a.8.8 0 0 1 .807.803c0 .465-.37.804-.807.804a.799.799 0 0 1-.81-.804.8.8 0 0 1 .81-.803zm.647.803a.649.649 0 1 0-1.298 0 .65.65 0 1 0 1.298 0zm-.816.465h-.138v-.926h.35c.218 0 .325.08.325.262 0 .167-.102.24-.239.257l.262.407h-.157l-.243-.4h-.16zm.168-.52c.118 0 .224-.008.224-.152 0-.113-.105-.136-.2-.136h-.192v.287z"/><path id="2gjaP" d="M53 1066.816l3.068-3.562c.214-.254.783-.926.985-1.23.379-.544.467-.951.467-1.294 0-.95-.682-1.647-1.68-1.647-.593 0-1.084.266-1.4.749-.165.252-.265.569-.278 1.001h-.934c.037-.85.303-1.37.63-1.75.354-.406.946-.863 1.995-.863 1.49 0 2.6 1.066 2.6 2.523 0 .57-.164 1.091-.668 1.814-.353.495-.809 1.014-1.15 1.406l-1.754 1.992h3.56v.86z"/><path id="2gjaQ" d="M61.564 1061.985l3.586-3.625h1.262l-3.938 3.942 4.064 4.513H65.25l-3.445-3.879-.24.24v3.64h-.935v-8.456h.934z"/><path id="2gjaR" d="M70.19 1061.697a3.682 3.682 0 0 1 1.427-.267c1.805 0 2.854 1.167 2.854 2.79 0 1.583-1.125 2.75-2.79 2.75a3.659 3.659 0 0 1-1.491-.292v-.886c.48.252 1.047.367 1.476.367.947 0 1.768-.634 1.869-1.622H70.77v-.813h2.764c-.201-.963-.985-1.482-1.88-1.482-.43 0-.973.114-1.465.34z"/><path id="2gjaS" d="M76.76 1061.56v2.156l2.12-2.156h1.111l-2.272 2.345 2.55 2.916h-1.186l-2.046-2.307-.278.266v2.04h-.909v-5.26z"/><path id="2gjaT" d="M82.09 1069.734h-.91v-8.176h.91v.735a2.253 2.253 0 0 1 1.793-.863c1.64 0 2.55 1.37 2.55 2.79 0 1.446-.922 2.751-2.513 2.751a2.228 2.228 0 0 1-1.83-.888zm3.407-5.514c0-1.294-.871-1.978-1.715-1.978-.846 0-1.741.697-1.741 1.965 0 1.077.68 1.952 1.754 1.952 1.059 0 1.702-.888 1.702-1.94z"/><path id="2gjaU" d="M91.842 1061.558h.91v5.26h-.91v-.734c-.301.392-.87.887-1.792.887-1.325 0-2.55-.94-2.55-2.79 0-1.813 1.212-2.751 2.55-2.751 1.01 0 1.553.558 1.792.875zm-3.408 2.624c0 1.127.632 1.977 1.717 1.977 1.112 0 1.743-.925 1.743-1.965 0-1.357-.934-1.952-1.743-1.952-.897 0-1.717.66-1.717 1.94z"/><path id="2gjaV" d="M94.47 1061.56h.91v2.156h2.473v-2.156h.909v5.26h-.91v-2.269H95.38v2.27h-.909z"/><path id="2gjaW" d="M116.992 1060.224a4.143 4.143 0 0 0-1.097-.787 3.595 3.595 0 0 0-1.453-.33c-1.944 0-3.382 1.573-3.382 3.525 0 2.296 1.854 3.449 3.395 3.449.568 0 1.124-.166 1.565-.393a3.83 3.83 0 0 0 .972-.71v1.166a4.375 4.375 0 0 1-2.537.825c-2.5 0-4.355-1.902-4.355-4.348 0-2.524 1.881-4.401 4.406-4.401.505 0 1.477.065 2.486.837z"/><path id="2gjaX" d="M118.15 1064.205c0-1.597 1.173-2.775 2.776-2.775 1.604 0 2.778 1.178 2.778 2.775 0 1.598-1.185 2.765-2.778 2.765-1.589 0-2.776-1.167-2.776-2.765m.936 0c0 1.293.908 1.954 1.84 1.954.946 0 1.842-.673 1.842-1.954 0-1.291-.881-1.964-1.842-1.964-.958 0-1.84.684-1.84 1.964"/><path id="2gjaY" d="M125.148 1062.38c.176-.253.417-.505.67-.658.405-.242.807-.292 1.149-.292.416 0 .845.038 1.236.367.342.292.455.634.455 1.002 0 .621-.328.938-.593 1.102.265.065.48.203.606.344.213.228.366.558.366.963 0 .544-.253 1.04-.682 1.356-.378.28-.922.406-1.49.406-.467 0-.96-.101-1.4-.445-.304-.227-.544-.57-.695-.899l.782-.33c.052.127.177.38.468.597.29.214.581.266.859.266.201 0 .605-.012.883-.203.175-.114.365-.355.365-.735a.695.695 0 0 0-.315-.609c-.266-.178-.619-.178-.86-.178h-.528v-.837h.44c.419 0 .607-.089.682-.14.14-.087.28-.239.28-.482 0-.227-.09-.43-.228-.544-.215-.189-.505-.189-.67-.189-.201 0-.454.038-.72.202a1.25 1.25 0 0 0-.428.457z"/><path id="2gjaZ" d="M134.493 1061.56v4.423h.782v2.232h-.834v-1.394h-3.989v1.394h-.832v-2.232c.454-.012.795-.317.972-.684.176-.368.214-.863.214-1.394v-2.345zm-.91.836h-1.868v1.972c0 .607-.138 1.176-.631 1.605h2.5z"/><path id="2gjaaa" d="M140.252 1061.558h.91v5.26h-.91v-.734c-.301.392-.87.887-1.792.887-1.325 0-2.55-.94-2.55-2.79 0-1.813 1.212-2.751 2.55-2.751 1.01 0 1.553.558 1.792.875zm-3.408 2.624c0 1.127.632 1.977 1.717 1.977 1.112 0 1.743-.925 1.743-1.965 0-1.357-.934-1.952-1.743-1.952-.897 0-1.717.66-1.717 1.94z"/><path id="2gjaab" d="M142.88 1061.56h.91v2.156h2.473v-2.156h.909v5.26h-.91v-2.269h-2.473v2.27h-.909z"/><path id="2gjaac" d="M148.56 1064.205c0-1.597 1.175-2.775 2.778-2.775s2.776 1.178 2.776 2.775c0 1.598-1.185 2.765-2.776 2.765-1.59 0-2.778-1.167-2.778-2.765m.934 0c0 1.293.91 1.954 1.844 1.954.947 0 1.842-.673 1.842-1.954 0-1.291-.883-1.964-1.842-1.964-.961 0-1.844.684-1.844 1.964"/><path id="2gjaad" d="M162.55 1063.027c-.479-.608-1.175-.785-1.641-.785-.972 0-1.856.684-1.856 1.965 0 1.28.909 1.952 1.843 1.952.544 0 1.213-.241 1.692-.825v1.092a2.79 2.79 0 0 1-1.666.544c-1.629 0-2.802-1.166-2.802-2.75 0-1.61 1.186-2.79 2.802-2.79.833 0 1.375.33 1.628.508z"/><clipPath id="2gjaf"><use xlink:href="#2gjaa"/></clipPath></defs><g><g transform="translate(-53 -992)"><g><use fill="#fefefe" xlink:href="#2gjab"/></g><g><use fill="#fefefe" xlink:href="#2gjac"/></g><g><use fill="#fefefe" xlink:href="#2gjad"/></g><g><use fill="#fefefe" xlink:href="#2gjae"/></g><g/><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjag"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjah"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjai"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaj"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjak"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjal"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjam"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjan"/></g><g clip-path="url(#2gjaf)">
            <use fill="#fefefe" xlink:href="#2gjao"/>
            </g><g clip-path="url(#2gjaf)">
            <use fill="#fefefe" xlink:href="#2gjap"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaq"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjar"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjas"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjat"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjau"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjav"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaw"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjax"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjay"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaz"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaA"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaB"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaC"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaD"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaE"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaF"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjat"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjau"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjav"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaw"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjax"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjay"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaz"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaA"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaB"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaC"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaD"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaE"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaF"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaG"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaH"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaI"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaJ"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaK"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaL"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaM"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaN"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaO"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaP"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaQ"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaR"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaS"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaT"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaU"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaV"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaW"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaX"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaY"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaZ"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaaa"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaab"/></g><g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaac"/></g>
            <g clip-path="url(#2gjaf)"><use fill="#fefefe" xlink:href="#2gjaad"/></g></g></g>
        button(type="button" class="presentational-product__header-buy")
          a.presentational-product__header-buy-text Купить
    advantages-slider(:sliderList="advantageList")
</template>

<script>
  import AdvantagesSlider from './PresentationalProductSlider';

  import advantage_0 from '../assets/advantage_0.png';
  import advantage_1 from '../assets/advantage_1.png';
  import advantage_2 from '../assets/advantage_2.png';
  import advantage_3 from '../assets/advantage_3.png';
  import advantage_4 from '../assets/advantage_4.png';
  import advantage_5 from '../assets/advantage_5.png';
  import advantage_6 from '../assets/advantage_6.png';

  const advantages = [
    {
      id: 1,
      img: advantage_0,
      text: 'Защищённый изогнутым стеклом 2К-дисплей с диагональю 8,4 или 10,8 дюйма  поражает детализацией картинки. ' +
        'Технология ClariVu 5.0 расширяет динамический диапазон, увеличивая контрастность и насыщенность, а режим Eye Comfort ' +
        'снижает усталость глаз при использовании планшета вечером и ночью.'
    },

    {
      id: 2,
      img: advantage_1,
      text: 'Восьмиядерный процессор Kirin 960 в связке с 4 ГБ оперативной памяти обеспечивает безупречную производительность ' +
        'как для рабочих задач, так и в играх. А внутренняя память объёмом 32 или 64 ГБ вмещает все необходимые документы, файлы ' +
        'и медиаконтент.'
    },

    {
      id: 3,
      img: advantage_2,
      text: 'Защищённый изогнутым стеклом 2К-дисплей с диагональю 8,4 или 10,8 дюйма  поражает детализацией картинки. Т' +
        'ехнология ClariVu 5.0 расширяет динамический диапазон, увеличивая контрастность и насыщенность, а ' +
        'режим Eye Comfort снижает усталость глаз при использовании планшета вечером и ночью.'
    },

    {
      id: 4,
      img: advantage_3,
      text: 'Благодаря ёмким аккумуляторам на 5 100 мА·ч в восьмидюймовой и 7 500 мА·ч в десятидюймовой версиях планшета ' +
        'обеспечивается высокая автономность даже при активном использовании. Все модели поддерживают технологию Huawei Quick' +
        ' Charge и полностью заряжаются всего за пару часов.'

    },

    {
      id: 5,
      img: advantage_4,
      text: 'Основная камера планшета оснащена 13-мегапиксельным сенсором и способна снимать качественные фото и видео. ' +
        'Фронтальная 8-мегапиксельная камера подходит как для селфи, так и для проведения видеоконференций.'
    },

    {
      id: 6,
      img: advantage_5,
      text: 'В 10-дюймовой модели MediaPad M5 предусмотрен разъём Pogo Pins для подключения внешней клавиатуры. ' +
        'А Pro-версия планшета поставляется вместе с распознающим 4 096 степеней нажатия стилусом M-Pen, ' +
        'дополнительно оснащённым кнопками быстрого доступа для снятия скриншотов, удаления изображений и других действий.'

    },

    {
      id: 7,
      img: advantage_6,
      text: 'Оболочка EMUI 8.0 с продуманным интерфейсом обеспечивает удобство и высокую скорость работы. ' +
        'На 10-дюймовой версии планшета в режиме десктопа работа упрощается ещё больше за счёт удобной навигации ' +
        'и панели задач как на компьютере.'
    }
  ];

  export default {
    name: 'PresentationalProduct',
    data: function () {
      return {
        advantageList: advantages
      }
    },

    components: {
      AdvantagesSlider
    }
  };
</script>

<style lang="scss">
  .presentational-product__header-title {
    width: 212px;
    height: 82px;
    margin: auto;
  }
  .presentational-product__header-wrapper {
    display: flex;
    flex-direction: column;

    width: 100%;
  }
  .presentational-product__header {
    display: flex;
    flex-direction: column;
    align-items: center;

    width: 100%;
    min-width: 320px;
    height: 500px;
    margin: 0 auto;

    background-color: #6d2261;
  }
  .presentational-product__photo {
    margin: 76px auto 33px auto;

  }
  .presentational-product__header-buy {
    display: block;

    width: 66%;
    min-width: 212px;
    height: 40px;
    margin: 25px 17%;

    background: none;
    border-radius: 2px;
    border: 1px solid $color-white;
    cursor: pointer;

    &:hover {
      background-color: $color-pink-near;
      border-color: $color-pink-near;
    }
  }
  .presentational-product__header-buy-text {
    display: block;

    width: 54px;
    height: 26px;
    margin: 7px auto;

    color: $color-white;
    font-family: Oswald;
    font-size: 18px;
    font-weight: 400;
    line-height: 24px;
    text-transform: uppercase;
  }


  @media (min-width: $tablet-width) {
    .presentational-product__header {
      width: 100%;
      height: 429px;

      flex-direction: row;
    }
    .presentational-product__photo {
      margin: 0 5%;
    }
    .presentational-product__header-buy {
      width: 212px;
      margin: 25px auto;
    }
  }
  @media (min-width: $desktop-width) {
    .presentational-product__header {
      width: $desktop-width;
      height: 580px;
    }
    .presentational-product__header-title {
      margin-left: 0;
    }
    .presentational-product__header-buy {
      width: 238px;
      height: 50px;
      margin-left: 0;
    }
    .presentational-product__header-buy-text {
      margin: 12px auto;
    }
    .presentational-product__header-title {
      width: 318px;
      height: 122px;
    }
    .presentational-product__photo {
      margin: 0 82px 0 140px;
    }
  }
</style>
